proj.org
#+title: Proj

* LED Groupings:
** Group 0:
*** LED 1-2 (Pins 2-3)
Control function for these pins should do following:
- Called by heartrate sensor
- activate first pins
- call subsequent group functions to start looping
** Group 1: Signal speed scale \(\frac{16}{22} \times \frac{1}{7}\)
*** LED 3-7 (Pins 4-8)
Bach Bundel
*** LED 8-13 (Pins 9-14)
IN Path 1
*** LED 14-15 (Pins 15-16)
IN Path 2 - Completion triggers LEDs 16-17 before group 2 start
** Group 2:
*** LED 16-17 (Pins 17-18)
AV Node, Hold for scale of \(\frac{10}{22}\)
** Group 3:
*** LED 18-26 (Pins 19-27)
Bundle of sexism, signal speed scale: \(\frac{2}{22} \times \frac{1}{9}\)
** Group 4: Signal speed scale \(\frac{4}{22} \times \frac{1}{8})\)
*** LED 33-40 (Pins 34-41)
LV Purkinje fiber
*** LED 27-32 (Pins 28-33)
RV Purkinje fiber




* Sudo code

strandActive[8] = [True, False, False...]
/tracks which strands should be running/
strandLastUpdate[8] = [0, 0, 0, ...]
/tracks time between last update for each strand (Need to reset when complete?)/
strandRates[8] = [x, y, z, ...]
/update rates for each strand/
strandLastPin[8] = [1, 3, 8, ...]
/tracks last pin update for each strand. In compination with/ strandMaxPin /can be used to check for strand termination/
strandMaxPin[8] = [7, 13, 15, ...]
num_strands = 8

while (looping condition) {
    for strand in range(num_strands):
        current_time= millis()
        elapsed = current_time - strandLastUpdata[strand]
        if elapsed >= strandRates[strand] & stransActive[strand]
            update(strand)
            if strandLastPin[strand] = strandMaxPin[strand]:
                strandActive[strand] = false
}


* Assumptions made:
- time for each group represents time for longest path to complete
  and therefore each led will activate in \(\frac{1}{n} \times \text{Strand rate}\)
- arduino led activation time is instantanious
-



* HRMonitor
sample at rate of 1/ms
window size of 500
