proj.tex
% Created 2025-02-20 Thu 14:33
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Martin Hawks}
\date{\today}
\title{Proj}
\hypersetup{
 pdfauthor={Martin Hawks},
 pdftitle={Proj},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{LED Groupings:}
\label{sec:org2ed4d61}
\subsection{Group 0:}
\label{sec:orgd0fa567}
\subsubsection{LED 1-2 (Pins 2-3)}
\label{sec:orgd9f1c5e}
Control function for these pins should do following:
\begin{itemize}
\item Called by heartrate sensor
\item activate first pins
\item call subsequent group functions to start looping
\end{itemize}
\subsection{Group 1: Signal speed scale \(\frac{16}{22} \times \frac{1}{7}\)}
\label{sec:orgdcebe1f}
\subsubsection{LED 3-7 (Pins 4-8)}
\label{sec:orgb965e32}
Bach Bundel
\subsubsection{LED 8-13 (Pins 9-14)}
\label{sec:org8fc3e9b}
IN Path 1
\subsubsection{LED 14-15 (Pins 15-16)}
\label{sec:orgfef0162}
IN Path 2 - Completion triggers LEDs 16-17 before group 2 start
\subsection{Group 2:}
\label{sec:org5a35ca7}
\subsubsection{LED 16-17 (Pins 17-18)}
\label{sec:org3e6e75b}
AV Node, Hold for scale of \(\frac{10}{22}\)
\subsection{Group 3:}
\label{sec:org2c09e79}
\subsubsection{LED 18-26 (Pins 19-27)}
\label{sec:orgd17c996}
Bundle of sexism, signal speed scale: \(\frac{2}{22} \times \frac{1}{9}\)
\subsection{Group 4: Signal speed scale \(\frac{4}{22} \times \frac{1}{8})\)}
\label{sec:org0116218}
\subsubsection{LED 33-40 (Pins 34-41)}
\label{sec:org8691df1}
LV Purkinje fiber
\subsubsection{LED 27-32 (Pins 28-33)}
\label{sec:org34cd8ef}
RV Purkinje fiber




\section{Sudo code}
\label{sec:org6d70adb}

strandActive[8] = [True, False, False\ldots{}]
\emph{tracks which strands should be running}
strandLastUpdate[8] = [0, 0, 0, \ldots{}]
\emph{tracks time between last update for each strand (Need to reset when complete?)}
strandRates[8] = [x, y, z, \ldots{}]
\emph{update rates for each strand}
strandLastPin[8] = [1, 3, 8, \ldots{}]
\emph{tracks last pin update for each strand. In compination with} strandMaxPin \emph{can be used to check for strand termination}
strandMaxPin[8] = [7, 13, 15, \ldots{}]
num\textsubscript{strands} = 8

while (looping condition) \{
    for strand in range(num\textsubscript{strands}):
        current\textsubscript{time}= millis()
        elapsed = current\textsubscript{time} - strandLastUpdata[strand]
        if elapsed >= strandRates[strand] \& stransActive[strand]
            update(strand)
            if strandLastPin[strand] = strandMaxPin[strand]:
                strandActive[strand] = false
\}


\section{Assumptions made:}
\label{sec:orgc3f06b4}
\begin{itemize}
\item time for each group represents time for longest path to complete
and therefore each led will activate
\item arduino led activation time is instantanious
\item 
\end{itemize}
\end{document}
